README.org
#+TITLE: Emacs configuration file
#+AUTHOR: Jonathan David Page
#+PROPERTY: header-args:emacs-lisp :tangle init.el :noweb yes :lexical yes

* Prelude

This file organizes settings from most-to-least general. If you're
interested in basing your own configuration on mine, but don't want
all of my bells and whistles (or you want different bells and
whistles), then this is probably the section to keep. It describes a
fairly minimal Emacs setup, with as few packages as
possible.[fn:packages] In particular, it pulls in package management
and sets up some sane defaults, many of which are pulled from the
[[https://git.sr.ht/~technomancy/better-defaults][better-defaults package]].[fn:better-defaults]

#+BEGIN_SRC emacs-lisp
  ;;; init.el --- main init   -*- lexical-binding: t -*-

  ;;; Commentary:
  ;; THIS IS A GENERATED FILE; changes should be made to README.org

  ;;; Code:

  ; I guess this is useful for pre-27 Emacs, but it's mostly so that flycheck stops
  ; yelling at me.
  (require 'early-init (expand-file-name "early-init.el" user-emacs-directory))
#+END_SRC

I use lexical binding (I believe now the default in Emacs 27.1) and a
lot of byte-compilation. Now that we have =early-init.el=, we can
byte-compile the main init file, as we can use it to tell Emacs that a
newer uncompiled file should be preferred to the byte-compiled file.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  ;;; early-init.el --- early bird init   -*- lexical-binding: t; no-byte-compile: t -*-

  ;;; Commentary:
  ;; THIS IS A GENERATED FILE; changes should be made to README.org

  ;;; Code:

  (setq load-prefer-newer t)
#+END_SRC

[fn:packages] Specifically: =straight.el=, =use-package=, =no-littering= and
on macOS, =exec-path-from-shell=.

[fn:better-defaults] I originally used better-defaults directly, but
got fed up with having to peek inside it to check if a setting had
already been configured. Additionally, it sets up some things I don't
care about: =ido-mode= (I use =ivy=) and =isearch= (I use =swiper=). I include
=ivy= and =swiper= when I spin off versions of this file for people, so I
haven't bothered to set up =ido-mode= and =isearch=. Check =better-defaults=
for how to enable them.

** Package Management

Package management and configuration is based on a combination of
[[https://github.com/jwiegley/use-package][use-package]] for declarative package configuration, and [[https://github.com/raxod502/straight.el][straight.el]] for
reproducible package installation. The [[file:straight/versions/default.el][lock file]] generated by
=straight.el= is checked in alongside the configration. Between the two
of these, I can delay loading packages until they're needed, and I can
revert to older versions of packages if (when) something breaks.

Some configuration options need to be set before the bootstrap code
for =straight.el= is loaded. Specifically, we want =use-package= to
automatically tell =straight.el= about the packages we're using so that
they can be installed. The setting below prevents us from having to
use the =:straight= option in =use-package= forms (which is the
replacement for =:ensure=, which should not be used).

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq straight-use-package-by-default t)
#+END_SRC

Because =straight.el= is installed before we've initialized any kind of
package management, bootstrap code must be run to set it up. This is
just copy-pasted from the README. Note that installing packages
requires Git to be installed and in the path. It also requires a
network connection.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+END_SRC

Now we can ask =straight.el= to install =use-package= for us.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq use-package-verbose t)
  (straight-use-package 'use-package)
  (require 'bind-key)  ; needed for byte-compilation
#+END_SRC

** No Littering

Emacs and its packages tend to scatter files around madly. The
[[https://github.com/emacscollective/no-littering][no-littering]] package helps tidy that up, and replaces a number of
paths that I previously configured manually.

#+BEGIN_SRC emacs-lisp
  (use-package no-littering)
#+END_SRC

I used to have this in my =early-init.el=, but it turns out that several
settings need to wait until we get to the main init phase, so here it
is, right at the top.

** Init File in Org-Mode

To help keep things organized without creating an explosion of little
files, the user configuration all lives in this =org-mode= file,
=README.org=. On buffer save, it gets tangled into regular elisp files,
=init.el=. If for some reason the auto-tangle doesn't work, it can be
trigged manually with =org-babel-tangle= (=C-c C-v t=).

#+BEGIN_SRC emacs-lisp
  (defun my/tangle-init ()
    "Tangle the buffer if it's README.org in the user dir."
    (when (equal (buffer-file-name)
                 (expand-file-name "README.org" user-emacs-directory))
      ;; Avoid running hooks when tangling
      (let ((prog-mode-hook nil)
            (org-confirm-babel-evaluate nil))
        (org-babel-tangle)
        (byte-compile-file (expand-file-name "init.el" user-emacs-directory)))))

  (add-hook 'after-save-hook 'my/tangle-init)
#+END_SRC

Since =init.el= gets overwritten constantly, leting Emacs add
customizations to it isn't very useful. It should put them in a
separate file instead. I personally don't use the custom interface, or
if I do, I eventually incorporate the changes into this file, but I
sometimes spin off versions of my config to help other people get
started, and it's good for them to be able to use the customization
interface.

#+BEGIN_SRC emacs-lisp
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
  (add-hook 'after-init-hook #'(lambda ()
                                 (message "loading %s" custom-file)
                                 (load custom-file t)))
#+END_SRC

** Platform-Specific Settings

I've elected to group platform-specific settings with related
platform-independant settings, rather than in one place. To assist
with both writing them and locating them, I define some constants to
test against and grep for.

*** GNU-Like Systems (incl. Windows)

Some Emacs features need to be configured differently depending on
whether or not the core utils installed support the options provided
by the GNU versions of those tools. Personally, I don't install the
GNU versions of tools on macOS and FreeBSD, since it can break other
things, but I do install them on Windows. If your systems look
different, you will need to change this.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (defconst *my/is-winnt*
    (or (string= "windows-nt" system-type)
        (string= "cygwin" system-type))
    "Non-nil if Emacs is running under Windows.")

  (defconst *my/is-gnu-like*
    (or *my/is-winnt*  ; usually means GoW/Cygwin/MSYS2
        (string-prefix-p "gnu" (symbol-name system-type)))
    "Non-nil if we expect GNU-like coreutils.")
#+END_SRC

*** macOS

While I've deployed versions of this config file to macOS, I don't
test it often, so some changes may be required.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (defconst *my/is-macos*
    (memq window-system '(mac ns))
    "Non-nil if Emacs is running under macOS.")
#+END_SRC

If you configure environment variables in your shell's config file,
GUI applications will miss out on them. The [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]]
package fixes this by launching a shell and querying it.

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :if *my/is-macos*
    :config
    (exec-path-from-shell-initialize))
#+END_SRC

** Safety & Backups

By default, Emacs keeps the previous version of each file around in a
backup file, which is placed alongside the backed-up file. This makes
them easy to find, but causes a lot of clutter. A better option is to
store them all in one directory; this also makes it practical to keep
multiple versions. (See [[No Littering]])

#+BEGIN_SRC emacs-lisp
  (setq backup-by-copying t    ; don't clobber symlinks
        version-control t      ; numbered backups
        delete-old-versions t  ; manage excess backups
        kept-old-versions 6
        kept-new-versions 9)
#+END_SRC

Delete files by moving them to the system trash, rather than unlinking
them from the filesystem.

#+BEGIN_SRC emacs-lisp
  (setq delete-by-moving-to-trash t)

  (when *my/is-macos*
    (defun system-move-file-to-trash (file)
      "Use \"trash\" to move FILE to the system trash.
       When using Homebrew, install it using \"brew install trash\"."
      (call-process (executable-find "trash")
                    nil 0 nil
                    file)))
#+END_SRC

** History & Recent File Persistence

Emacs can save your minibuffer history and several other histories to
a file for you using the built-in [[https://www.emacswiki.org/emacs/SaveHist][savehist-mode]]. This allows them to
persist across sessions.

#+BEGIN_SRC emacs-lisp
  (use-package savehist
    :custom
    (savehist-save-minibuffer-history t)
    (history-length 10000)  ; set to t for infinite history
    (history-delete-duplicates t)
    (savehist-additional-variables '(kill-ring
                                     search-ring
                                     regexp-search-ring
                                     shell-command-history))
    :config
    (savehist-mode +1))
#+END_SRC

Emacs can also save a list of your recently-edited files using the
built-in [[https://www.emacswiki.org/emacs/RecentFiles][recentf-mode]] There are better tools for jumping between large
numbers of files, which I set up later, but this is good to have
around, especially for loose files.

#+BEGIN_SRC emacs-lisp
  (use-package recentf
    :custom
    (recentf-max-saved-items 100)
    :config
    (recentf-mode +1))
#+END_SRC

Last but not least, the built-in [[https://www.emacswiki.org/emacs/SavePlace][save-place-mode]] will remember where
the cursor was in a file when it was closed, and put the cursor back
there when it's reopened.

#+BEGIN_SRC emacs-lisp
  (use-package saveplace
    :config
    (save-place-mode +1))
#+END_SRC

** Buffer Management

By default, if two buffers point to different files with the same
filename, Emacs numbers them. The built-in [[https://www.emacswiki.org/emacs/uniquify][uniquify]] library changes
this behaviour to use the folder name instead.

#+BEGIN_SRC emacs-lisp
  (use-package uniquify
    :straight nil
    :custom
    (uniquify-buffer-name-style 'forward))
#+END_SRC

The built-in [[https://www.emacswiki.org/emacs/IbufferMode][ibuffer-mode]] provides an improved interface for buffer
management. All that's needed to set it up is to bind it to a key.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC

I want my buffers to be set up for UTF-8 with UNIX line endings unless
otherwise specified, even on Windows.

#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
  (setq-default buffer-file-coding-system 'utf-8-unix)
#+END_SRC

When the file a buffer is monitoring is changed outside Emacs, it's
helpful to have the buffer updated to match the file if the buffer
hasn't been modified. The built-in [[https://www.emacswiki.org/emacs/AutoRevertMode][auto-revert-mode]] provides this
feature.

#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode +1)
#+END_SRC

