early-init.el
;;; early-init.el --- early bird init   -*- lexical-binding: t; no-byte-compile: t -*-

;;; Commentary:
;; THIS IS A GENERATED FILE; changes should be made to README.org

;;; Code:

(setq load-prefer-newer t)

(setq straight-use-package-by-default t)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'auto-compile)
(auto-compile-on-load-mode +1)
(auto-compile-on-save-mode +1)

(setq use-package-verbose t)
(straight-use-package 'use-package)
(require 'bind-key)  ; needed for byte-compilation

(defconst *my/is-winnt*
  (or (string= "windows-nt" system-type)
      (string= "cygwin" system-type))
  "Non-nil if Emacs is running under Windows.")

(defconst *my/is-gnu-like*
  (or *my/is-winnt*  ; usually means GoW/Cygwin/MSYS2
      (string-prefix-p "gnu" (symbol-name system-type)))
  "Non-nil if we expect GNU-like coreutils.")

(defconst *my/is-macos*
  (memq window-system '(mac ns))
  "Non-nil if Emacs is running under macOS.")

(use-package no-littering)
