README.org
** Sparse GUI

By default, Emacs provides a set of conventional UI elements. I like
to turn most of these off, since there are alternatives that I'm more
used to and take up less screen space. In spun-off configurations, I
turn all of these back on. These also go into the =early-init.el= file,
so that Emacs doesn't spend time loading those elements and then
unloading them again.

I prefer Emacs to go straight to an empty =*scratch*= when it loads,
with no startup message.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq inhibit-startup-message t)
  (setq initial-scratch-message nil)
#+END_SRC

The menu bar can be useful for rarely-used commands to which one
doesn't remember the keybindings. I generally prefer to use =M-x= to
search for them by name, rather than hunting through the menu bar.
However, on macOS, a menu bar gets drawn anyway, so we might as well
leave it enabled.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (unless *my/is-macos*
    (menu-bar-mode -1))
#+END_SRC

The toolbar is geared towards frequently-used commands, and outlives
its usefulness once you learn the keybindings.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
#+END_SRC

Word-wrapping is nicer than horizontal scrollbars, and there are
smaller vertical position indicators available than vertical
scrollbars.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (when (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
  (when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))
#+END_SRC

If you like line numbers, change this to =+1= instead of =-1=.

#+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode -1)
#+END_SRC

I find a blinking cursor distracting, but many people are used to it
or need it in order to locate the cursor. Again, change to =+1= from =-1=
to re-enable the cursor.

#+BEGIN_SRC emacs-lisp
  (blink-cursor-mode -1)
#+END_SRC

See [[https://www.emacswiki.org/emacs/AlarmBell][Alarm Bell]] on the Emacs Wiki for options related to the bell. I
currently prefer a simple flashing bell.

#+BEGIN_SRC emacs-lisp
  (setq visible-bell t)
#+END_SRC

Emacs often asks yes-or-no questions, but some of the prompts don't
accept bare y/n answers. Replacing the yes-or-no prompt with the
y-or-n prompt fixes that if you want less typing in your life.

#+BEGIN_SRC emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Core Text Editing

Conventional text editors allow you to replace text by selecting it
and beginning to type. Emacs can do that too with the built-in
[[https://www.emacswiki.org/emacs/DeleteSelectionMode][delete-selection-mode]].

#+BEGIN_SRC emacs-lisp
  (delete-selection-mode +1)
#+END_SRC

When doing cut/paste (kill/yank) from inside Emacs, save the system
clipboard to the kill ring so that we can get it back later. Also,
when pasting with the mouse, insert at the point, rather than the
actual click location.

#+BEGIN_SRC emacs-lisp
  (setq save-interprogram-paste-before-kill t
        mouse-yank-at-point t)
#+END_SRC

Show the parenthesis matching the one the cursor is on.

#+BEGIN_SRC emacs-lisp
  (show-paren-mode +1)
#+END_SRC

Use spaces instead of tabs for indentation by default. This can also
be toggled per-mode or per-buffer. Also, require a final newline in
files; per POSIX, it's required, though it usually doesn't matter.
However, it /does/ matter for a few files (=crontab=), and Git doesn't
seem to be a huge fan of files without trailing newlines.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq require-final-newline t)
#+END_SRC

Trailing whitespace tends to be a bit of a liability, since you can't
see it easily. We would like buffers to highlight it by default, with
the exception of the minibuffer, where it doesn't matter and tends to
jank up the display from some tools.

#+BEGIN_SRC emacs-lisp
  (setq-default show-trailing-whitespace t)

  (add-hook 'minibuffer-setup-hook #'(lambda ()
                                       (setq show-trailing-whitespace nil)))
#+END_SRC

Long lines are also a bit of a liability. Many people standardise on
80, but I usually settle on 88. Notably, the [[https://github.com/psf/black][Black autoformatter]] for
Python does this as well. This setting can be changed per-mode and
per-buffer.

#+BEGIN_SRC emacs-lisp
  (setq-default fill-column 88)
  (setq-default auto-fill-function 'do-auto-fill)
#+END_SRC

Some files do have long lines in them, and I like to have those lines
word-wrapped instead of scrolling off the side of the page.

#+BEGIN_SRC emacs-lisp
  (setq-default truncate-lines nil)
  (global-visual-line-mode 1)
#+END_SRC

By default, Emacs binds =M-z= to =zap-to-char=, which deletes everything
up to and including the specified character. An alternative that does
not delete the specified character, =zap-up-to-char=, is included with
Emacs. =better-defaults= rebinds this.

#+BEGIN_SRC emacs-lisp
  (autoload 'zap-up-to-char "misc"
    "Kill up to, but not including ARGth occurrence of CHAR." t)
  (global-set-key (kbd "M-z") 'zap-up-to-char)
#+END_SRC

Input special characters by typing the TeX code for them.

#+BEGIN_SRC emacs-lisp
  (setq default-input-method "TeX")
#+END_SRC

By default, Emacs searches for the ends of sentences by looking for a
full stop and two spaces. I'm not in the habit of writing two spaces
after a full stop, so I need it to look for one space, instead.

#+BEGIN_SRC emacs-lisp
  (setq sentence-end-double-space nil)
#+END_SRC

Emacs provides a feature called [[https://www.emacswiki.org/emacs/HippieExpand][hippie-expand]] which tries to expand
the word at the point into something more useful. It just needs to be
bound to a keystroke.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-/") 'hippie-expand)
#+END_SRC

** Spell-Checking

Emacs has a built-in spellchecker, [[https://www.emacswiki.org/emacs/FlySpell][Flyspell]], which works by shelling
out to another program, such as Ispell, Aspell, or Hunspell. If you're
on Windows, you're currently pretty much stuck with the old version of
Hunspell from EZWinPorts. If you find something better, please let me
know. If you're on Linux or macOS, my understanding is that GNU Aspell
is faster, but Hunspell has better language support; you should be
able to get either through your package manager.

#+BEGIN_SRC emacs-lisp
  (use-package ispell
    :defer t
    :custom
    (ispell-program-name (if *my/is-winnt* "hunspell" "aspell"))
    (ispell-dictionary "en_US"))

  (use-package flyspell
    :delight (flyspell-mode " ~")
    :hook ((text-mode . flyspell-mode)
           (prog-mode . flyspell-prog-mode)))
#+END_SRC

** Emacs Server

By starting an Emacs server, we can use /emacsclient/ to open files in
our current Emacs session. I've disabled this section, as I use a
systemd user service to run Emacs.

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'after-init-hook #'server-start)
#+END_SRC

** Apropos

The [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Apropos.html][apropos system]] is used for finding relevant commands. This option
expands the search to look for more stuff.

#+BEGIN_SRC emacs-lisp
  (setq apropos-do-all t)
#+END_SRC

** Ediff

The built-in [[https://www.emacswiki.org/emacs/EdiffMode][ediff-mode]] provides an interface for diffing files and
working with patches. By default it launches into a separate frame,
but we can tell it to load in the current frame instead. Additionally,
it's nicer if it displays windows side-by-side instead of stacked
vertically.

#+BEGIN_SRC emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain
        ediff-split-window-function 'split-window-horizontally)
#+END_SRC

** Mixed-DPI

Because I often have a mixed-DPI setup, if I'm under X, I need to be
able to rescale an entire Emacs frame at a time on the fly, so I also
include keybindings for that. This can be hooked into for e.g. fixing
treemacs icons.

#+BEGIN_SRC emacs-lisp
  (defvar my/toggle-face-height-hook nil
    "Called when toggling the face height for mixed-DPI setups.")

  (defun my/current-default-face-height ()
    "Get the height of the default face in the current frame."
    (face-attribute 'default :height (selected-frame)))

  (defun my/toggle-face-height ()
    "Toggle the height of the default face in the current frame.
  Useful when moving Emacs frames between monitors in mixed-DPI setups."
    (interactive)

    (set-face-attribute 'default (selected-frame) :height
                        (if (> (my/current-default-face-height) 80) 60 100))
    (run-hooks 'my/toggle-face-height-hook))

  (global-set-key (kbd "C-x t s") 'my/toggle-face-height)
#+END_SRC

* Visual Flair

No point in setting up your editor so that it can make coffee and do
your taxes if you can't stand looking at it. This section customizes
the visual aspects of the Emacs experience, and is fairly modular.

** Libraries

The [[https://github.com/magnars/dash.el][dash.el]] library provides extended functionality for dealing with
lists in elisp. It's used in enough packages it'll end up in all but
the most conservative configs anyway, so it might as well get included
explicitly so that it can be used here.

#+BEGIN_SRC emacs-lisp
  (use-package dash :config (global-dash-fontify-mode))
#+END_SRC

** Initial Frame Size

Emacs starts with a tiny frame. This is less than useful on modern monitors.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (add-to-list 'default-frame-alist '(width . 150))
  (add-to-list 'default-frame-alist '(height . 50))
#+END_SRC

** Fonts

I use [[https://github.com/belluzj/fantasque-sans][Fantasque Sans Mono]] for fixed-pitch text, and [[https://github.com/adobe-fonts/source-serif-pro][Source Serif Pro]]
for variable-pitch text.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (add-to-list 'default-frame-alist
               '(font . "Fantasque Sans Mono-12"))

  (set-face-attribute 'variable-pitch nil
                      :family "Source Serif Pro"
                      :height 1.25)
#+END_SRC

The height of 1.25 is chosen because otherwise it's too small on my
screen, and the reciprocal is exactly 0.8, which is useful for
fixed-width text which, for some reason, inherits its height from the
=variable-pitch= face.

Several modern coding fonts supply coding ligatures, which e.g.
display >= as \ge. Emacs can use these, but needs to be told what
characters to consider for ligatures. This is a bit of a pain, but one
side-benefit is that ligatures that you dislike can be selectively
disabled.

The machinery for setting this up involves giving Emacs a set of
regular expressions grouped by the first character of the ligature.
The following function makes the appropriate arrangements
automatically.

#+BEGIN_SRC emacs-lisp
  (defun my/enable-compositions (ligatures)
    "Set up the `composition-function-table' for a list of LIGATURES."
    (-each (-group-by 'string-to-char ligatures)
      (-lambda ((char . comps))
        (set-char-table-range composition-function-table char
                              `([,(regexp-opt comps) 0 font-shape-gstring])))))
#+END_SRC

All that remains is to pass in the strings that should become
ligatures.

#+BEGIN_SRC emacs-lisp
  (defvar my/compositions
    '("!=" "!=="
      "==" "===" "=>" "==>" "=>>" "=/=" "=<<"
      "->" "-->" "->>" "-<" "-<<"
      "<-" "<-<" "<<-" "<--" "<->" "<=<" "<<=" "<==" "<=>" "<~~" "<~" "<<<"
      "<<" "<=" "<~>" "<>" "<|||" "<||" "<|" "<|>" "<!--"
      ">->" ">=>" ">>=" ">>-" ">-" ">=" ">>" ">>>"
      "~~" "~>" "~~>"
      "|>" "||>" "|||>" "||"
      "::" "&&"
      ;; "//"  ;; c++-mode hangs when this is enabled???
      "/*" "/**/"
      "*/"))
  (my/enable-compositions my/compositions)
#+END_SRC

If the ligatures included in your font aren't enough for you, Emacs
has [[https://emacsredux.com/blog/2014/08/25/a-peek-at-emacs-24-dot-4-prettify-symbols-mode/][prettify-symbols-mode]], which can visually replace strings with
other strings, e.g. make the =lambda= elisp keyword display as =\lambda=.
It can be turned on per-buffer, per-mode, or globally. I find it
disruptive when enabled globally, but I may yet revisit it.

#+BEGIN_SRC emacs-lisp
  (global-prettify-symbols-mode -1)
#+END_SRC

** Color Scheme

I like [[https://github.com/morhetz/gruvbox][gruvbox]] ([[https://github.com/greduan/emacs-theme-gruvbox][Emacs version]]), which provides both dark and light
versions in a variety of contrast levels, and theming information for
a variety of common extensions.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (use-package gruvbox-theme
    :demand t
    :config
    (setq my/light-theme 'gruvbox-light-medium)
    (setq my/dark-theme 'gruvbox-dark-soft)
    (setq my/initial-theme my/dark-theme)
    (load-theme my/initial-theme t))
#+END_SRC

For eye-comfort, it's worth making it easy to toggle between dark and
light versions depending on the environment.

#+BEGIN_SRC emacs-lisp
  (defun my/toggle-theme ()
    "Toggle between dark and light themes."
    (interactive)

    (let ((is-dark (seq-contains-p custom-enabled-themes my/dark-theme)))
      (-each custom-enabled-themes 'disable-theme)
      (load-theme (if is-dark my/light-theme my/dark-theme) t)))

  (global-set-key (kbd "C-x t t") 'my/toggle-theme)
#+END_SRC

** Icons

[[https://github.com/domtronn/all-the-icons.el][All The Icons]] provides a set of icon-font based icons which can be
used by several other packages. You need to run =M-x
all-the-icons-install-fonts= before it will work.

#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons)
#+END_SRC

** Mode Line

The default Emacs modeline is pretty plain. I'm now using
[[https://github.com/seagle0128/doom-modeline][doom-modeline]]. I've also tried out [[https://github.com/TheBB/spaceline][Spaceline]] and [[https://github.com/milkypostman/powerline][Powerline]]; they're
fine, I just found this to be easier to work with.

#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :custom
    (doom-modeline-major-mode-icon nil)
    (doom-modeline-height 40)
    (doom-modeline-project-detection 'projectile)
    (doom-modeline-minor-modes t)
    (doom-modeline-checker-simple-format nil)
    (doom-modeline-gnus nil)
    (doom-modeline-irc nil)
    :config
    (progn
      (doom-modeline-mode +1)
      (column-number-mode +1)))
#+END_SRC

Once a few minor modes are enabled, the modeline can get cluttered.
The [[https://www.emacswiki.org/emacs/DelightedModes][delight]] package can help with this, by abbreviating or eliding
mode names. =use-package= integrates with it as well. Some of the modes
enabled in the [[Prelude]] section can benefit from this.

#+BEGIN_SRC emacs-lisp
  (use-package delight)
  (use-package emacs
    :delight
    (auto-fill-function " $")
    (visual-line-mode))
#+END_SRC

** Nicer Form Feeds

Some elisp files use the form-feed character to separate sections
(along with some Emacs modes---I'm looking at you,
=elisp-compile-mode=). We can display them as lines using
[[https://github.com/purcell/page-break-lines][page-break-lines]] (or [[https://depp.brause.cc/form-feed/][form-feed]], if you're using Emacs in text mode).

#+BEGIN_SRC emacs-lisp
  (use-package page-break-lines
    :delight page-break-lines-mode
    :config (global-page-break-lines-mode +1))
#+END_SRC

