early-init.el

(setq inhibit-startup-message t)
(setq initial-scratch-message nil)

(unless *my/is-macos*
  (menu-bar-mode -1))

(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))

(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))
(when (fboundp 'horizontal-scroll-bar-mode)
  (horizontal-scroll-bar-mode -1))

(add-to-list 'default-frame-alist
             '(font . "Fantasque Sans Mono-10"))

(set-face-attribute 'variable-pitch nil
                    :family "Source Serif Pro"
                    :height 1.25)

(use-package gruvbox-theme
  :demand t
  :config
  (setq my/light-theme 'gruvbox-light-medium)
  (setq my/dark-theme 'gruvbox-dark-soft)
  (setq my/initial-theme my/dark-theme)
  (load-theme my/initial-theme t))
