README.org
** Python

Emacs includes a solid built-in =python-mode=, but since we have LSP
support, we can extend that a bit. (There are many other Python modes,
such as Elpy, but I jump between languages enough that I'm beginning
to value consistency a bit.)

This is currently disabled due to struggling with LSP.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package lsp-python-ms
    :defer t
    :custom
    (lsp-python-ms-auto-install-server t)
    (lsp-python-ms-executable (executable-find "Microsoft.Python.LanguageServer"))
    :hook (python-mode . (lambda ()
                           (require 'lsp-python-ms)
                           (lsp))))
#+END_SRC

Automatically format Python code on save using the Black formatter.

#+BEGIN_SRC emacs-lisp
  (use-package blacken
    :delight blacken-mode
    :hook (python-mode . blacken-mode))
#+END_SRC

** Rust

There are multiple Rust modes, and I settled on [[https://github.com/brotzeit/rustic][Rustic]] for
undocumented reasons. This is currently disabled because I haven't
been using Rust lately.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package rustic
    :mode ("\\.rs\\'" . rustic-mode))
#+END_SRC

** Scheme

Geiser, for great justice.

#+BEGIN_SRC emacs-lisp
  (use-package geiser)
  (use-package geiser-chicken)
  (use-package geiser-guile
    :custom (geiser-guile-binary "guile3"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "chicken" no-littering-etc-directory))
  (use-package chicken
    :custom (geiser-chicken-binary "chicken-csi")
    :straight nil)
#+END_SRC

** TODO TeX

So there's a built-in TeX mode, or we can add [[https://www.gnu.org/software/auctex/][AUCTeX]]. Right now this
assumes we're on Windows, using [[https://www.sumatrapdfreader.org/free-pdf-reader.html][Sumatra PDF]] as a viewer; I should
probably fix it to use Zathura or something.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package tex-site
    :straight auctex
    :mode ("\\.tex\\'" . TeX-latex-mode)
    :custom
    (TeX-parse-self t) ; Enable parse on load.
    (TeX-auto-save t) ; Enable parse on save.
    (TeX-view-program-list
     '(("SumatraPDF"
        ("SumatraPDF.exe -reuse-instance"
         (mode-io-correlate " -forward-search \"%b\" %n")
         " %o")
        "SumatraPDF")))
    (TeX-view-program-selection '((output-pdf "SumatraPDF")))
    (TeX-source-correlate-mode t)
    (TeX-source-correlate-method 'synctex))
#+END_SRC

** Zig

[[https://github.com/ziglang/zig-mode][zig-mode]] for syntax highlighting and auto-indentation.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package zig-mode
    :commands (zig-mode)
    :hook (zig-mode . lsp)
    :mode ("\\.zig\\'" . zig-mode))
#+END_SRC

Projectile integration.

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load 'projectile
    (projectile-register-project-type
     'zig '("build.zig")
     :compile "zig build"
     :test "zig build"))
#+END_SRC

... so I tried to set up an LSP server for Zig, but right now it
crashes whenever I open more than one file, which is a bit of of a
non-starter. Also, makes Windows-specific assumptions.

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load "lsp-mode"
    (add-to-list 'lsp-language-id-configuration '(zig-mode . "zig"))
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection
                       (expand-file-name "~/Source/zls/zig-cache/bin/zls.exe"))
      :major-modes '(zig-mode)
      :server-id 'zls)))
#+END_SRC

* Machine-Specific Settings

Machine-specific settings are loaded by keying off of an string
constructed from the hostname and system type.

#+BEGIN_SRC emacs-lisp
  (defconst *my/local-id*
    (format "%s.%s" (downcase (system-name)) system-type)
    "Hostname-based identifier for the current installation.")

  (defvar my/local-config-count 0
    "The number of local configs that have been loaded.")

  (defmacro my/config-for-local-id (id &rest body)
    "Run BODY only on the installation identified by ID."
    (declare (indent defun))
    `(when (string= ,id *my/local-id*)
       (setq my/local-config-count (1+ my/local-config-count))
       ,@body))
#+END_SRC

Note that the machine-specific settings are loaded as the last thing,
after the rest of the init file has been processed. I mostly use these
for setting up installation paths for things which can vary between
machines, e.g. Python.

** Caladbolg

#+BEGIN_SRC emacs-lisp
  (my/config-for-local-id "caladbolg.berkeley-unix"
    (setq projectile-project-search-path '("~/src"))
    (setq treemacs-python-executable (executable-find "python3")))
#+END_SRC

** Galatine

#+BEGIN_SRC emacs-lisp
  (my/config-for-local-id "galatine.windows-nt"
    (setq projectile-project-search-path '("~/Source"))
    (setq treemacs-python-executable (executable-find "python"))
    (setq flycheck-python-pycompile-executable (executable-find "python"))
    (setq ispell-program-name (expand-file-name "~/bin/hunspell-current/bin/hunspell.exe")))
#+END_SRC

* Playground

Experimental, ad-hoc, questionable, and poorly-understood
configuration sections.

** TRAMP

I'm not quite sure what this is trying to accomplish, or whether it
accomplished it.

#+BEGIN_SRC emacs-lisp
  (setq-default explicit-shell-file-name "/bin/bash")
#+END_SRC

** Fortune

Gets a fortune from the web, and displays it in the =*scratch*= buffer.
On UNIX, we could use the actual /fortune/ program, but I can't find a
port of it for Windows.

#+BEGIN_SRC emacs-lisp
  (defvar my/fortune "https://api.justyy.workers.dev/api/fortune")

  (defun my/fortune ()
    "Insert a fortune from the web into the *scratch* buffer."
    (interactive)
    (let ((url-request-method "GET"))
      (url-retrieve
       my/fortune
       (lambda (status)
         (unless (plist-member status :error)
           (goto-char (point-min))
           (re-search-forward "^$")
           (let ((p (point)))
             (insert "[")
             (goto-char (point-max))
             (insert "]")
             (goto-char p))
           (let ((message (car (json-parse-buffer :array-type 'list))))
             (with-current-buffer "*scratch*"
               (goto-char (point-max))
               (let ((p (point)))
                 (insert message)
                 (comment-region p (point)))))
           (kill-buffer))))))

  ;; (my/fortune)
#+END_SRC

Potentially a better option would just be to teach Emacs how to read
fortune files itself. Also, the output would probably look nicer in a
formatted buffer, rather than tossed into an elisp buffer as a
comment.

** TODO Splash Screen

A groovy splash screen. Currently included in this repo.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "groovy-splash" no-littering-etc-directory))
  (use-package groovy-splash
    :straight nil
    :hook (after-init . groovy-splash-show)
    :custom
    (groovy-splash-segments '(groovy-splash-groovy-fill
                              groovy-splash-blank-line
                              groovy-splash-logo
                              groovy-splash-blank-line
                              groovy-splash-rule
                              groovy-splash-blank-line
                              groovy-splash-recentf
                              groovy-splash-blank-fill
                              groovy-splash-oracle
                              groovy-splash-blank-line)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package nasm-mode)
  (add-to-list 'load-path (expand-file-name "noweb-mode" no-littering-etc-directory))
  (use-package noweb-mode
    :straight nil)

  (use-package forth-mode
    :straight nil
    :load-path "lib")
#+END_SRC

* Coda

Write out completion messages after loading each of the main files.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (message "early bird init complete")

  (provide 'early-init)
  ;;; early-init.el ends here
#+END_SRC

Additionally, for the =init.el=, we write out which machine-specific
section(s) we loaded.

#+BEGIN_SRC emacs-lisp
  (message "Loaded %d sections matching local id \"%s\""
           my/local-config-count *my/local-id*)
  (message "main init complete")

  (provide 'init)
  ;;; init.el ends here
#+END_SRC
