early-init.el

(message "early bird init complete")

(provide 'early-init)
;;; early-init.el ends here
